GRADIENTS = {
    'Пасмурно': {'R': [128, 255], 'G': [128, 255], 'B': [128, 255]
                 },
    'Небольшой дождь': {'R': [0, 255], 'G': [69, 255], 'B': [100, 255]
                        },
    'Ясно': {'R': [255, 255], 'G': [255, 255], 'B': [128, 255]
             },
    'Снег': {'R': [64, 255], 'G': [88, 255], 'B': [128, 255]
             },
    'Малооблачно': {'R': [128, 255], 'G': [128, 255], 'B': [128, 128]
                    },
    'Облачно с прояснениями': {'R': [128, 255], 'G': [128, 255], 'B': [128, 192]
                               },
    'Дождь': {'R': [0, 128], 'G': [69, 128], 'B': [100, 128]
              },
    'Небольшой снег': {'R': [64, 255], 'G': [88, 255], 'B': [128, 255]
                       },
    'Дождь со снегом': {'R': [0, 128], 'G': [69, 128], 'B': [100, 128]
                        },
}

WEATHER_IMAGES = {
    'Пасмурно': 'cloud',
    'Небольшой дождь': 'rain',
    'Ясно': 'sun',
    'Снег': 'snow',
    'Небольшой снег': 'snow',
    'Дождь со снегом': 'snow',
    'Малооблачно': 'cloud',
    'Облачно с прояснениями': 'cloud',
    'Дождь': 'rain',
}
